     A          R CMLREC1                   PFILE(MAECLI)
     A            CLIE
     A            NOMB
     A            DIRE1
     A            DIRE2
     A            CDAD
     A            PROV
     A            CDP
     A          K CLIE
